lowatt_enedis/wsdl/ConsultationMesuresDetailleesV3/ADAM.ConsulterMesuresServiceReadV3.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/v3.0"
                  xmlns:sc="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/v3.0"
                  xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:css="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/common"
                  xmlns:err="http://www.enedis.fr/sge/b2b/technique/v1.0">

    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import schemaLocation="./ADAM.ConsulterMesuresDetailleesCommun.xsd"
                        namespace="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/common"/>
            <xsd:import schemaLocation="./ENEDIS.Dictionnaire.Technique.v1.0.xsd"
                        namespace="http://www.enedis.fr/sge/b2b/technique/v1.0"/>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="consulterMesuresDetailleesV3">
        <wsdl:part name="parameters" element="css:consulterMesuresDetailleesV3"></wsdl:part>
    </wsdl:message>
    <wsdl:message name="consulterMesuresDetailleesResponseV3">
        <wsdl:part name="parameters" element="css:consulterMesuresDetailleesResponseV3"></wsdl:part>
    </wsdl:message>

    <wsdl:message name="adamB2BFault">
        <wsdl:part name="errorB2B" element="err:erreur"/>
    </wsdl:message>

    <wsdl:portType name="AdamConsultationMesuresServiceReadPortType">
        <wsdl:operation name="consulterMesuresDetailleesV3">
            <wsdl:input message="sc:consulterMesuresDetailleesV3"></wsdl:input>
            <wsdl:output message="sc:consulterMesuresDetailleesResponseV3"></wsdl:output>
            <wsdl:fault name="fault" message="sc:adamB2BFault"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="AdamConsultationMesuresServiceReadHttpBinding"
                  type="sc:AdamConsultationMesuresServiceReadPortType">
        <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="consulterMesuresDetailleesV3">
            <wsdlsoap:operation soapAction="http://www.enedis.fr/sge/b2b/services/consultationmesuresdetaillees/v3.0"/>
            <wsdl:input>
                <wsdlsoap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <wsdlsoap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="AdamConsultationMesuresServiceRead">
        <wsdl:port name="AdamConsultationMesuresServiceReadHttpPort"
                   binding="sc:AdamConsultationMesuresServiceReadHttpBinding">
            <wsdlsoap:address location="https://sge-b2b.enedis.fr/ConsultationMesuresDetaillees/v3.0"/>
        </wsdl:port>
    </wsdl:service>

</wsdl:definitions>
